In [73]:
import pandas as pd
import numpy as np
df = pd.read_excel('filter3.xlsx')
df

                     Adress        Tenant  AverageIncome Debts  Rent
0                 Gogol_3_2  Ponomarov VD           5000   yes  1500
1                 Gogol_3_3  Ponomarov AD           4500    no  2000
2                 Gogol_3_4    Ulanova TI           3200    no  1200
3                 Gogol_3_5   Budanova AI           6700    no  2100
4                 Gogol_3_6    Komarov II           8100   yes  1800
5                 Gogol_3_7    Komarov DP           4900    no  1000
6          Grecheskaya_1_45   Abramyan LL           5100   yes   900
7             Korolova_2_56     Ivanov II           2900   yes   800
8             Korolova_2_57     Ivanov PI           7800    no  1300
9             Korolova_2_58    Shatrov IV           6400   yes  1600
10            Korolova_2_59     Petrov MM          10000    no  2300
11            Korolova_2_60    Sidorov VK           4400    no  1900
12            Korolova_2_61  Sidorchyk KM           5750    no  1600
13  Malaya Arnautskaya_23_6      Kogan MG           6100   yes  1700
14  Malaya Arnautskaya_23_7  Polyakova MO           5200    no  1400

In [74]:
#task 0
df['Subsidy'] = np.select([df['Debts'] == "no", df['AverageIncome'] < 4500], [df['Rent'] * 0.1, df['Rent'] == 0])
df

                     Adress        Tenant  AverageIncome Debts  Rent  Subsidy
0                 Gogol_3_2  Ponomarov VD           5000   yes  1500      0.0
1                 Gogol_3_3  Ponomarov AD           4500    no  2000    200.0
2                 Gogol_3_4    Ulanova TI           3200    no  1200    120.0
3                 Gogol_3_5   Budanova AI           6700    no  2100    210.0
4                 Gogol_3_6    Komarov II           8100   yes  1800      0.0
5                 Gogol_3_7    Komarov DP           4900    no  1000    100.0
6          Grecheskaya_1_45   Abramyan LL           5100   yes   900      0.0
7             Korolova_2_56     Ivanov II           2900   yes   800      0.0
8             Korolova_2_57     Ivanov PI           7800    no  1300    130.0
9             Korolova_2_58    Shatrov IV           6400   yes  1600      0.0
10            Korolova_2_59     Petrov MM          10000    no  2300    230.0
11            Korolova_2_60    Sidorov VK           4400    no  1900    190.0
12            Korolova_2_61  Sidorchyk KM           5750    no  1600    160.0
13  Malaya Arnautskaya_23_6      Kogan MG           6100   yes  1700      0.0
14  Malaya Arnautskaya_23_7  Polyakova MO           5200    no  1400    140.0

In [75]:
#task1
dt1 = df.loc[df['Subsidy'] > 0]
dt1

                     Adress        Tenant  AverageIncome Debts  Rent  Subsidy
1                 Gogol_3_3  Ponomarov AD           4500    no  2000    200.0
2                 Gogol_3_4    Ulanova TI           3200    no  1200    120.0
3                 Gogol_3_5   Budanova AI           6700    no  2100    210.0
5                 Gogol_3_7    Komarov DP           4900    no  1000    100.0
8             Korolova_2_57     Ivanov PI           7800    no  1300    130.0
10            Korolova_2_59     Petrov MM          10000    no  2300    230.0
11            Korolova_2_60    Sidorov VK           4400    no  1900    190.0
12            Korolova_2_61  Sidorchyk KM           5750    no  1600    160.0
14  Malaya Arnautskaya_23_7  Polyakova MO           5200    no  1400    140.0

In [76]:
#task 2
dt2 = df.loc[(df['AverageIncome'] < 4500) & (df['Debts'] == "yes")]
dt2

          Adress     Tenant  AverageIncome Debts  Rent  Subsidy
7  Korolova_2_56  Ivanov II           2900   yes   800      0.0

In [77]:
#task 3
dt3 = df.loc[df['Rent'] > 2000 ]
dt3

           Adress       Tenant  AverageIncome Debts  Rent  Subsidy
3       Gogol_3_5  Budanova AI           6700    no  2100    210.0
10  Korolova_2_59    Petrov MM          10000    no  2300    230.0

In [78]:
#task 4
dt4 = df.loc[df['AverageIncome'] >= 3000]
dt4_res = dt4.loc[dt4['AverageIncome'] <= 5000]
dt4_res

           Adress        Tenant  AverageIncome Debts  Rent  Subsidy
0       Gogol_3_2  Ponomarov VD           5000   yes  1500      0.0
1       Gogol_3_3  Ponomarov AD           4500    no  2000    200.0
2       Gogol_3_4    Ulanova TI           3200    no  1200    120.0
5       Gogol_3_7    Komarov DP           4900    no  1000    100.0
11  Korolova_2_60    Sidorov VK           4400    no  1900    190.0

In [79]:
#task 5
dt1_res = dt1.loc[dt1['Rent'] > 1800]
dt1_res

           Adress        Tenant  AverageIncome Debts  Rent  Subsidy
1       Gogol_3_3  Ponomarov AD           4500    no  2000    200.0
3       Gogol_3_5   Budanova AI           6700    no  2100    210.0
10  Korolova_2_59     Petrov MM          10000    no  2300    230.0
11  Korolova_2_60    Sidorov VK           4400    no  1900    190.0

In [80]:
#task 6
dt6_first_cond = dt1.loc[(dt1['Subsidy'] > 0) & (dt1['Rent'] > 1800)]
dt6_second_cond = df.loc[(df['AverageIncome'] < 5000) & (df['Debts'] == 'yes')]
dt6_result = pd.concat([dt6_first_cond, dt6_second_cond], join = 'outer')
dt6_result

           Adress        Tenant  AverageIncome Debts  Rent  Subsidy
1       Gogol_3_3  Ponomarov AD           4500    no  2000    200.0
3       Gogol_3_5   Budanova AI           6700    no  2100    210.0
10  Korolova_2_59     Petrov MM          10000    no  2300    230.0
11  Korolova_2_60    Sidorov VK           4400    no  1900    190.0
7   Korolova_2_56     Ivanov II           2900   yes   800      0.0

In [81]:
#task 7
dt7_first_cond = df.loc[(df['Debts'] == 'yes') & (df['Rent'] < 1600)]
dt7_second_cond = dt4.loc[(dt4['AverageIncome'] > 3000) & (dt4['AverageIncome'] < 5000) & (df['Rent'] < 1800)]
dt7_res = pd.concat([dt7_first_cond, dt7_second_cond], join = 'outer')
dt7_res

             Adress        Tenant  AverageIncome Debts  Rent  Subsidy
0         Gogol_3_2  Ponomarov VD           5000   yes  1500      0.0
6  Grecheskaya_1_45   Abramyan LL           5100   yes   900      0.0
7     Korolova_2_56     Ivanov II           2900   yes   800      0.0
2         Gogol_3_4    Ulanova TI           3200    no  1200    120.0
5         Gogol_3_7    Komarov DP           4900    no  1000    100.0